app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def users
 @users = User.all
 @users = User.paginate(:page => params[:page], :per_page => 10)