app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def index
    @users = User.all
    #@users = User.paginate(:page => params[:page], :per_page => 10)
      @users = User.all
      @myusers = User.all
      @myusers = User.where({invited_by_id: current_user.id})

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]
---
 def destroy
   @users = User.find(params[:id])
   @users.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "company" = $3, "job_title" = $4, "phone" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["first_name", "Jeff"], ["last_name", "Gipson"], ["company", "Test Co Inc"], ["job_title", "Tester1"], ["phone", "5738371315"], ["updated_at", "2018-11-04 01:45:14.198692"], ["id", 11]]
---
 def update
    @users = User.find(params[:id])
    @users.update_attributes(params.require(:user).permit(:first_name, :last_name, :email, :company, :job_title, :phone, :role,:agency_id))