app/controllers/users_controller.rb

  def users
    @users = User.all
    @users = User.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"