app/controllers/users/invitations_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def new
    @users = User.all
    @myusers = User.all
    @myusers = User.where({invited_by_id: current_user.id})